OdDAI.Attribute.setNames(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Set a new original name and name (in lower case) of the attribute.
Attribute's original name is exactly a name specified in the source .exp file.
Unlike the original name, the name is always represented in lower case.
\param name [in] An ANSI string that contains the new attribute name.

OdDAI.Attribute.m_originalName
The attribute's original name.
Attribute's original name is exactly a name specified in the source .exp file.

OdDAI.Attribute.m_name
The attribute name (always is represented in lower case).

OdDAI.Attribute.m_pParentEntity
A raw pointer to the parent entity.

OdDAI.Attribute.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Attribute.originalName
\details
Retrieves the current attribute's original name.
Attribute's original name is exactly a name specified in the source .exp file.
Unlike the original name, the name is always represented in lower case.
\returns An ANSI string that contains the attribute's original name.

OdDAI.Attribute.name
\details
Retrieves the current attribute's name.
\returns An ANSI string that contains the attribute's name.

OdDAI.Attribute
\details
A class that implements the storing and manipulating of attributes.